{"authorDailyContributionsMap":{"Geralddtan":[{"date":"2022-01-19","commitResults":[{"hash":"50133ac196be7f8723f3aeaab495340b1bd0b214","messageTitle":"We now only have a very skeleton of the Duke class.","messageBody":"This needs to be changed to be able to utilise good software engineering principles by creating new classes\n\nExtracting out common behaviours into a separate method \u0026 creating new classes for abstraction allows us to employ good swe principles\n\nLet\u0027s edit Duke class \u0026 create new quote class (Additional random feature)\n\nDuke class:\n* Employed abstraction principles for print methods so that changes can be easily made\n* Instantiated new Quote class which generates a Quote of the Day\n* Utilise Scanner to get user input\n\nQuote class: Abstracted out the generation of quotes to a separate class\n* Utilise Arraylist and random number generator to randomly generate a quote\n","fileTypesAndContributionMap":{"java":{"insertions":62,"deletions":1}}},{"hash":"ebd2a742c4b18168096002d9f25422dc4b7a3087","messageTitle":"Add some characteristics to duke, our motivator!","messageBody":"","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":2,"deletions":8}}},{"hash":"0125a8b03b12be949fc6ed2c58112aa77787bec9","messageTitle":"Add functionality to store and display user tasks","messageBody":"Right now, we perform all commands through Duke\u0027s main method. This can be abstracted out into another method for simplicity.\n\nLets abstract this code out into a method performCommand which performs the user task! This method will call the necessary functions within the Duke class from now on.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":37,"deletions":10}}},{"hash":"e73185e95cb291af86279a051b29d5aa594a6b76","messageTitle":"Add a Task class which is able to keep track of its done status. Created toString representation for easy printing","messageBody":"Expand performCommand method to cater to instances of \"mark\" \u0026 \"unmark\"\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":85,"deletions":13}}}]}]},"authorFileTypeContributionMap":{"Geralddtan":{"java":160,"md":0,"fxml":0,"sh":0,"bat":0,"gradle":0,"txt":0}},"authorContributionVariance":{"Geralddtan":6600.556},"authorDisplayNameMap":{"Geralddtan":"GERA.. WEI"}}
